tutorials/fluidSolidInteraction/coupledTemperature/laminar/nonlinearGeometryElasticBeam/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    interface
    {
        type            mixed;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 1;
    }
    outlet
    {
        type  zeroGradient;
    }
    inlet
    {
        type  fixedValue;
        value uniform 305;
    }
    bottom
    {
        type  zeroGradient;
    }
    top
    {
        type  zeroGradient;
    }
    left
    {
        type  zeroGradient;
    }
    symmetry
    {
        type  symmetryPlane;
    }
}


// ************************************************************************* //
