tutorials/fluidSolidInteraction/coupledTemperature/laminar/nonlinearGeometryElasticBeam/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    rubber
    {
        type        thermoNeoHookeanElastic;
        rho         rho [1 -3 0 0 0 0 0] 1000;
        E           E [1 -1 -2 0 0 0 0] 1e4;
        nu          nu [0 0 0 0 0 0 0] 0.4;
        alpha       alpha [0 0 0 -1 0 0 0] 1e-6;
        T0          T0 [0 0 0 1 0 0 0] 300;
    }
);

// ************************************************************************* //
