tutorials/fluidSolidInteraction/coupledTemperature/laminar/nonlinearGeometryElasticBeam/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this decomposeParDict is not used but it must be present to keep
// argList happy. Use instead the decomposeParDicts in system/fluid and
// system/solid

numberOfSubdomains 4;


// ************************************************************************* //
